## Plan Result (sbox_landing)




<pre><code>Plan: 160 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone.azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone.azurerm_eventhub_namespace.this
  * module.data_landing_zone.azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone.azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone.azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone.azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone.azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone.azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone.azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone.azurerm_log_analytics_workspace.this
  * module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;di001&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;di002&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;dp001&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;dp002&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;external-storage&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;logging&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;management&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;metadata&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;runtimes&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;shared-integration&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;shared-product&#34;]
  * module.data_landing_zone.azurerm_resource_group.this[&#34;storage&#34;]
  * module.data_landing_zone.azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone.azurerm_role_assignment.datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone.azurerm_role_assignment.datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this[&#34;external&#34;]
  * module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this[&#34;raw&#34;]
  * module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this[&#34;workspace&#34;]
  * module.data_landing_zone.azurerm_storage_management_policy.this[&#34;curated&#34;]
  * module.data_landing_zone.azurerm_storage_management_policy.this[&#34;external&#34;]
  * module.data_landing_zone.azurerm_storage_management_policy.this[&#34;raw&#34;]
  * module.data_landing_zone.azurerm_storage_management_policy.this[&#34;workspace&#34;]
  * module.data_landing_zone.azurerm_synapse_workspace.example
  * module.data_landing_zone.module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone.module.logging_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone.module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone.module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone.module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone.module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone.module.metadata_mssql.azurerm_mssql_database.this[&#34;dlrm-ingest-metadata-db-sbox&#34;]
  * module.data_landing_zone.module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone.module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone.module.metadata_mssql.random_password.mssql_password[0]
  * module.data_landing_zone.module.metadata_mysql.azurerm_mysql_flexible_database.this[&#34;dlrm-ingest-HiveMetastoreDb-sbox&#34;]
  * module.data_landing_zone.module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone.module.metadata_mysql.random_password.mysql_password[0]
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone.module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone.module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone.module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-eventhub&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-sql&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-storage&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-webapp&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-inbound&#34;]
  * module.data_landing_zone.module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-outbound&#34;]
  * module.data_landing_zone.module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.data_landing_zone.module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-public&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-001&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-002&#34;]
  * module.data_landing_zone.module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_landing_zone.module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone.module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone.module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;dlrmingestcuratedsbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;dlrmingestrawsbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;dlrm-ingest-integration-databricks001-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;dlrm-ingest-meta001-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;dlrm-ingest-metadata-mssql-sbox&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-curated&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-raw&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone.module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone.module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone.module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone.module.shir001.azurerm_key_vault_secret.shir_password
  * module.data_landing_zone.module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone.module.shir001.azurerm_lb_backend_address_pool.shir
  * module.data_landing_zone.module.shir001.azurerm_lb_nat_pool.shir
  * module.data_landing_zone.module.shir001.azurerm_lb_probe.shir
  * module.data_landing_zone.module.shir001.azurerm_lb_rule.shir
  * module.data_landing_zone.module.shir001.random_password.shir_password
  * module.data_landing_zone.module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone.module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone.module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone.module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone.module.storage[&#34;curated&#34;].random_string.storage_account_random_string
  * module.data_landing_zone.module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone.module.storage[&#34;external&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone.module.storage[&#34;external&#34;].random_string.storage_account_random_string
  * module.data_landing_zone.module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone.module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone.module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone.module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone.module.storage[&#34;raw&#34;].random_string.storage_account_random_string
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp001&#34;]
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp002&#34;]
  * module.data_landing_zone.module.storage[&#34;workspace&#34;].random_string.storage_account_random_string
  * module.data_landing_zone.module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone.module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
  * module.data_landing_zone.module.shir001.module.shir_vmss.random_string.password




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone.azurerm_data_factory_integration_runtime_self_hosted.this will be created
  + resource "azurerm_data_factory_integration_runtime_self_hosted" "this" {
      + data_factory_id             = (known after apply)
      + description                 = "Data Landing Zone - Self Hosted Integration Runtime running on dlrm-ingest-shir001"
      + id                          = (known after apply)
      + name                        = "dlrm-ingest-runtimes-dataFactory001-shir001"
      + primary_authorization_key   = (known after apply)
      + secondary_authorization_key = (known after apply)
    }

  # module.data_landing_zone.azurerm_eventhub_namespace.this will be created
  + resource "azurerm_eventhub_namespace" "this" {
      + auto_inflate_enabled                      = true
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "uksouth"
      + maximum_throughput_units                  = 2
      + minimum_tls_version                       = (known after apply)
      + name                                      = "dlrm-ingest-integration-eventHubNamespace001-sbox"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "dlrm-ingest-shared-integration-sbox"
      + sku                                       = "Standard"
      + tags                                      = (known after apply)
      + zone_redundant                            = true

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.data_landing_zone.azurerm_key_vault_secret.log_analytics_workspace_id will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-logAnalytics001-sbox-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.log_analytics_workspace_secret will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-logAnalytics001-sbox-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mssql_password will be created
  + resource "azurerm_key_vault_secret" "mssql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-metadata-mssql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mssql_username will be created
  + resource "azurerm_key_vault_secret" "mssql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-metadata-mssql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mysql_connection_string will be created
  + resource "azurerm_key_vault_secret" "mysql_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-metadata-mysql-connection-string-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mysql_password will be created
  + resource "azurerm_key_vault_secret" "mysql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-metadata-mysql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_key_vault_secret.mysql_username will be created
  + resource "azurerm_key_vault_secret" "mysql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "dlrm-ingest-metadata-mysql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "dlrm-ingest-logAnalytics001-sbox"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dlrm-ingest-logging-sbox"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.blob.core.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "dlrm-ingest-blob-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dfs.core.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "dlrm-ingest-dfs-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.dfs.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.mysql.database.azure.com"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "dlrm-ingest-mysql-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.mysql.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone.azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.vaultcore.azure.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "dlrm-ingest-vaultcore-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = (known after apply)
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["di001"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-di001-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["di002"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-di002-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["dp001"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-dp001-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["dp002"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-dp002-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["external-storage"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-external-storage-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["logging"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-logging-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["management"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-management-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["metadata"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-metadata-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["network"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-network-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["runtimes"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-runtimes-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["shared-integration"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-shared-integration-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["shared-product"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-shared-product-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_resource_group.this["storage"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-storage-sbox"
      + tags     = (known after apply)
    }

  # module.data_landing_zone.azurerm_role_assignment.datafactory_databricks will be created
  + resource "azurerm_role_assignment" "datafactory_databricks" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone.azurerm_role_assignment.datafactory_storage["curated"] will be created
  + resource "azurerm_role_assignment" "datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone.azurerm_role_assignment.datafactory_storage["raw"] will be created
  + resource "azurerm_role_assignment" "datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this["curated"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "dlrm-ingest-curated-sbox"
      + owner              = (known after apply)
      + storage_account_id = (known after apply)
    }

  # module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this["external"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "dlrm-ingest-external-sbox"
      + owner              = (known after apply)
      + storage_account_id = (known after apply)
    }

  # module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this["raw"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "dlrm-ingest-raw-sbox"
      + owner              = (known after apply)
      + storage_account_id = (known after apply)
    }

  # module.data_landing_zone.azurerm_storage_data_lake_gen2_filesystem.this["workspace"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "dlrm-ingest-workspace-sbox"
      + owner              = (known after apply)
      + storage_account_id = (known after apply)
    }

  # module.data_landing_zone.azurerm_storage_management_policy.this["curated"] will be created
  + resource "azurerm_storage_management_policy" "this" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = 90
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation_greater_than                  = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation                               = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # module.data_landing_zone.azurerm_storage_management_policy.this["external"] will be created
  + res

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

tive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = (known after apply)

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days = 365
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "82.69.13.75",
            ]
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-00",
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-01",
            ]
        }
    }

  # module.data_landing_zone.module.storage["workspace"].azurerm_storage_container.container["data"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "data"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "dlrmingestworkspacesbox"
    }

  # module.data_landing_zone.module.storage["workspace"].azurerm_storage_container.container["dp001"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "dp001"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "dlrmingestworkspacesbox"
    }

  # module.data_landing_zone.module.storage["workspace"].azurerm_storage_container.container["dp002"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "dp002"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "dlrmingestworkspacesbox"
    }

  # module.data_landing_zone.module.storage["workspace"].random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.data_landing_zone.module.storage_pe["curated-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-curated-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestcuratedsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["curated-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-curated-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestcuratedsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["external-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-external-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-external-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestexternalsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["external-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-external-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-external-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestexternalsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["raw-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-raw-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestrawsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["raw-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-raw-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestrawsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["workspace-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-workspace-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestworkspacesbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone.module.storage_pe["workspace-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-workspace-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestworkspacesbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone.module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "VMAdmin"
      + computer_name_prefix                              = "shir001"
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + extension_operations_enabled                      = (known after apply)
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "dlrm-ingest-shir001-vmss"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "dlrm-ingest-runtimes-sbox"
      + scale_in_policy                                   = (known after apply)
      + single_placement_group                            = true
      + sku                                               = "Standard_D4ds_v5"
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false
      + zones                                             = [
          + "1",
        ]

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "dlrm-ingest-shir001-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + load_balancer_inbound_nat_rules_ids    = (known after apply)
              + name                                   = "dlrm-ingest-shir001-ipconfig"
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }
    }

  # module.data_landing_zone.module.shir001.module.shir_vmss.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 160 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->